renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_cellular/src/private/r_cellular_receive_task.c
/*
 * Copyright (c) 2025 Renesas Electronics Corporation and/or its affiliates
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/**********************************************************************************************************************
 * File Name    : r_cellular_receive_task.c
 * Description  : Functions of the receiving task.
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Includes   <System Includes> , "Project Includes"
 *********************************************************************************************************************/
#include "r_cellular_if.h"
#include "cellular_freertos.h"
#include "cellular_receive_task.h"
#include "cellular_private_api.h"
#include "at_command.h"

/**********************************************************************************************************************
 * Macro definitions
 *********************************************************************************************************************/
#define CHAR_CHECK_1    ('+')
#define CHAR_CHECK_2    ('>')
#define CHAR_CHECK_3    (':')
#define CHAR_CHECK_4    ('\n')
#define CHAR_CHECK_5    (',')
#define CHAR_CHECK_6    (' ')
#define CHAR_CHECK_7    ('\r')
#define CHAR_END        ('\0')

/**********************************************************************************************************************
 * Typedef definitions
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Exported global variables
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Private (static) variables and functions
 *********************************************************************************************************************/
static const uint8_t s_atc_res_go_send[]            = ATC_RES_GO_SEND;
static const uint8_t s_atc_res_ok[]                 = ATC_RES_OK;
static const uint8_t s_atc_res_error[]              = ATC_RES_ERROR;
static const uint8_t s_atc_res_no_carrier[]         = ATC_RES_NO_CARRIER;
static const uint8_t s_atc_res_connect[]            = ATC_RES_CONNECT;
static const uint8_t s_atc_res_exit[]               = ATC_RES_EXIT;
static const uint8_t s_atc_res_data_receive[]       = ATC_RES_DATA_RECEIVE;
static const uint8_t s_atc_res_data_receive_qird[]  = ATC_RES_DATA_RECEIVE_QIRD;
static const uint8_t s_atc_res_read_dns[]           = ATC_RES_READ_DNS;
static const uint8_t s_atc_res_pin_lock_status[]    = ATC_RES_PIN_LOCK_STATUS;
static const uint8_t s_atc_res_socket_close[]       = ATC_RES_SOCKET_CLOSE;
static const uint8_t s_atc_res_system_start[]       = ATC_RES_SYSTEM_START;
static const uint8_t s_atc_res_attach_status[]      = ATC_RES_ATTACH_STATUS;
static const uint8_t s_atc_res_ap_connect_config[]  = ATC_RES_AP_CONNECT_CONFIG;
static const uint8_t s_atc_res_function_level[]     = ATC_RES_FUNCTION_LEVEL;
static const uint8_t s_atc_res_timezone[]           = ATC_RES_TIMEZONE;
static const uint8_t s_atc_res_creg_status[]        = ATC_RES_CREG_STATUS;
static const uint8_t s_atc_res_cereg_status[]       = ATC_RES_CEREG_STATUS;
static const uint8_t s_atc_res_get_time[]           = ATC_RES_GET_TIME;
static const uint8_t s_atc_res_get_service_status[] = ATC_RES_GET_SERVICE_STATUS;
static const uint8_t s_atc_res_get_pdp_status[]     = ATC_RES_GET_PDP_STATUS;
static const uint8_t s_atc_res_get_ip_addr[]        = ATC_RES_GET_IP_ADDR;
static const uint8_t s_atc_res_get_psms[]           = ATC_RES_GET_PSMS;
static const uint8_t s_atc_res_get_edrxs[]          = ATC_RES_GET_EDRXS;
static const uint8_t s_atc_res_set_edrxs[]          = ATC_RES_SET_EDRXS;
static const uint8_t s_atc_res_get_signal[]         = ATC_RES_GET_SIGNAL;
static const uint8_t s_atc_res_command_send_sim[]   = ATC_RES_COMMAND_SEND_SIM;
static const uint8_t s_atc_res_timezene_info[]      = ATC_RES_TIMEZONE_INFO;
static const uint8_t s_atc_res_ind_info[]           = ATC_RES_IND_INFO;
static const uint8_t s_atc_res_svn[]                = ATC_RES_SVN;
static const uint8_t s_atc_res_get_phone_num[]      = ATC_RES_GET_PHONE_NUM;
static const uint8_t s_atc_res_get_iccid[]          = ATC_RES_GET_ICCID;
static const uint8_t s_atc_res_ping[]               = ATC_RES_PING;
static const uint8_t s_atc_res_get_cellinfo[]       = ATC_RES_GET_CELLINFO;
static const uint8_t s_atc_res_get_autoconnect[]    = ATC_RES_GET_AUTOCONNECT;
static const uint8_t s_atc_res_get_ctm[]            = ATC_RES_GET_CTM;
static const uint8_t s_atc_res_smcwrx[]             = ATC_RES_SMCWRX;
static const uint8_t s_atc_res_smcwtx[]             = ATC_RES_SMCWTX;
static const uint8_t s_atc_res_shutdown[]           = ATC_RES_SHUTDOWN;
static const uint8_t s_atc_res_firmupgrade[]        = ATC_RES_FIRMUPGRADE;
static const uint8_t s_atc_res_get_certificate[]    = ATC_RES_GET_CERTIFICATE;

static const uint8_t * const sp_cellular_atc_res_tbl[CELLULAR_RES_MAX] =
{
    s_atc_res_go_send,
    s_atc_res_ok,
    s_atc_res_error,
    s_atc_res_no_carrier,
    s_atc_res_connect,
    s_atc_res_exit,
    s_atc_res_data_receive,
    s_atc_res_data_receive_qird,
    s_atc_res_read_dns,
    s_atc_res_pin_lock_status,
    s_atc_res_socket_close,
    s_atc_res_system_start,
    s_atc_res_attach_status,
    s_atc_res_ap_connect_config,
    s_atc_res_function_level,
    s_atc_res_timezone,
    s_atc_res_creg_status,
    s_atc_res_cereg_status,
    s_atc_res_get_time,
    s_atc_res_get_service_status,
    s_atc_res_get_pdp_status,
    s_atc_res_get_ip_addr,
    s_atc_res_get_psms,
    s_atc_res_get_edrxs,
    s_atc_res_set_edrxs,
    s_atc_res_get_signal,
    s_atc_res_command_send_sim,
    s_atc_res_timezene_info,
    s_atc_res_ind_info,
    s_atc_res_svn,
    s_atc_res_get_phone_num,
    s_atc_res_get_iccid,
    s_atc_res_ping,
    s_atc_res_get_cellinfo,
    s_atc_res_get_autoconnect,
    s_atc_res_get_ctm,
    s_atc_res_smcwrx,
    s_atc_res_smcwtx,
    s_atc_res_shutdown,
    s_atc_res_firmupgrade,
    s_atc_res_get_certificate,
};

static void                cellular_job_check (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static e_atc_return_code_t cellular_response_string_check (uint8_t * p_string);

static void cellular_response_check (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_data_send_command (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_get_data_reception (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_request_data (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_store_data (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_dns_result (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_get_ap_connect_status (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_get_ap_connect_config (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_station_info (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_control_level (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_cpin_status (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_get_time (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_get_imei (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_get_imsi (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_system_start (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_disconnect_socket (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_get_timezone (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_get_service_status (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_get_pdp_status (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_get_pdp_addr (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_get_psms (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_get_edrx (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_get_signal (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_res_command_send_sim (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_timezone_info (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_ind_info (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_get_svn (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_get_lrsvn (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_get_phone_number (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_get_iccid (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_ping (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_get_cellinfo (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_get_autoconnect (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_get_ctm (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_set_smcwrx (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_set_smcwtx (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_shutdown_info (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_firmupgrade_info (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_get_certificate (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_get_revision (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_response_skip (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_memclear (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void cellular_exit (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);

