renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_cellular/src/private/r_cellular_receive_task.c
static void         cellular_system_state_change (st_cellular_ctrl_t * p_ctrl, int32_t stat);
static e_atc_list_t cellular_get_at_command (st_cellular_ctrl_t * const p_ctrl);

static void    cellular_set_atc_response (st_cellular_ctrl_t * const p_ctrl, const e_cellular_atc_return_t result);
static void    cellular_cleardata (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static void    cellular_charcheck (st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive);
static int32_t binary_conversion (int32_t binary);

static void(* p_cellular_recvtask_api[])(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive) =
{
        cellular_data_send_command,
        cellular_memclear,
        cellular_memclear,
        cellular_memclear,
        cellular_memclear,
        cellular_exit,
        cellular_get_data_reception,
        cellular_request_data,
        cellular_dns_result,
        cellular_cpin_status,
        cellular_disconnect_socket,
        cellular_system_start,
        cellular_get_ap_connect_status,
        cellular_get_ap_connect_config,
        cellular_control_level,
        cellular_get_timezone,
        cellular_station_info,
        cellular_station_info,
        cellular_get_time,
        cellular_get_service_status,
        cellular_get_pdp_status,
        cellular_get_pdp_addr,
        cellular_get_psms,
        cellular_get_edrx,
        cellular_get_edrx,
        cellular_get_signal,
        cellular_res_command_send_sim,
        cellular_timezone_info,
        cellular_ind_info,
        cellular_get_svn,
        cellular_get_phone_number,
        cellular_get_iccid,
        cellular_ping,
        cellular_get_cellinfo,
        cellular_get_autoconnect,
        cellular_get_ctm,
        cellular_set_smcwrx,
        cellular_set_smcwtx,
        cellular_shutdown_info,
        cellular_firmupgrade_info,
        cellular_get_certificate,
        cellular_response_skip,
        cellular_store_data,
        cellular_response_check,
        cellular_job_check
};

/***********************************************************************************************
 * Function Name  @fn            cellular_recv_task
 * Description    @details       Process incoming data from the module.
 * Arguments      @param[in/out] p_pvParameters -
 *                                  Pointer to the parameter given at the time of task creation.
 **********************************************************************************************/
#if BSP_CFG_RTOS_USED == (1)
void cellular_recv_task(void * const p_pvParameters)
#elif BSP_CFG_RTOS_USED == (5)
void cellular_recv_task(ULONG p_pvParameters)
#endif
{
#if BSP_CFG_RTOS_USED == (1)
    st_cellular_ctrl_t * const p_ctrl = p_pvParameters;
#elif BSP_CFG_RTOS_USED == (5)
    st_cellular_ctrl_t * const p_ctrl = gp_cellular_ctrl;
#endif

    sci_err_t             sci_ret          = SCI_SUCCESS;
    st_cellular_receive_t cellular_receive = {0,0,CELLULAR_RES_NONE,JOB_STATUS_NONE,0,0,0};

    memset(p_ctrl->sci_ctrl.receive_buff, 0, sizeof(p_ctrl->sci_ctrl.receive_buff));

    cellular_synchro_event_group(p_ctrl->eventgroup, CELLULAR_RECV_TASK_BIT,
                                (CELLULAR_MAIN_TASK_BIT | CELLULAR_RECV_TASK_BIT), CELLULAR_TIME_WAIT_TASK_START);

    /* WAIT_LOOP */
    while (1)
    {
        sci_ret = R_SCI_Receive(p_ctrl->sci_ctrl.sci_hdl, &cellular_receive.data, 1);
        if (SCI_SUCCESS != sci_ret)
        {
            cellular_delay_task(1);
        }
        else
        {
            if (cellular_receive.recv_count > CELLULAR_ATC_RESPONSE_BUFF_SIZE)
            {
                cellular_receive.overflow_flag = 1;
                CELLULAR_LOG_ERROR(("sci buffer overflow\n"));
                cellular_memclear(p_ctrl, &cellular_receive);
            }
            else
            {
                p_ctrl->sci_ctrl.receive_buff[cellular_receive.recv_count] = cellular_receive.data;
                cellular_receive.recv_count++;
            }
            (* p_cellular_recvtask_api[cellular_receive.job_no])(p_ctrl, &cellular_receive);
        }
        if (CELLULAR_MODULE_OPERATING_RESET == p_ctrl->module_status)
        {
            memset(p_ctrl->sci_ctrl.receive_buff, 0, sizeof(p_ctrl->sci_ctrl.receive_buff));
            memset(&cellular_receive, 0, sizeof(st_cellular_receive_t));
            cellular_receive.job_no = CELLULAR_RES_NONE;
            p_ctrl->module_status   = CELLULAR_MODULE_OPERATING_LEVEL0;
        }
    }
}
/**********************************************************************************************************************
 * End of function cellular_recv_task
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_job_check
 * Description    @details       Analyze incoming data.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_job_check(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    switch (p_cellular_receive->job_status)
    {
        case JOB_STATUS_NONE:
        {
            if ((char)p_cellular_receive->data == (CHAR_CHECK_4))   // (uint8_t)->(char)
            {
                if ((NULL != strstr((char *)p_ctrl->sci_ctrl.receive_buff, ATC_RES_BEGIN_OR_END)) && //cast
                    (2    == p_cellular_receive->recv_count))
                {
                    p_cellular_receive->job_status  = JOB_STATUS_FIRST_CHAR_CHECK;
                    p_cellular_receive->tmp_recvcnt = p_cellular_receive->recv_count;
                }
                else
                {
                    cellular_memclear(p_ctrl, p_cellular_receive);
                }
            }
            break;
        }
        case JOB_STATUS_FIRST_CHAR_CHECK:
        {
            if ((char)p_cellular_receive->data == (CHAR_CHECK_1))          //(uint8_t)->(char)
            {
                p_cellular_receive->job_status = JOB_STATUS_COLON_CHECK;
            }
            else if ((char)p_cellular_receive->data == (CHAR_CHECK_2))     //(uint8_t)->(char)
            {
                p_cellular_receive->job_no = CELLULAR_RES_GO_SEND;
            }
            else
            {
                p_cellular_receive->job_no = CELLULAR_RES_CHECK;
            }
            break;
        }
        case JOB_STATUS_COLON_CHECK:
        {
            if ((char)p_cellular_receive->data == (CHAR_CHECK_3))          //(uint8_t)->(char)
            {
                p_cellular_receive->job_no
                = cellular_response_string_check(&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt]);
                p_cellular_receive->tmp_recvcnt = p_cellular_receive->recv_count;
            }
            else if ((char)p_cellular_receive->data == (CHAR_CHECK_4))     //(uint8_t)->(char)
            {
                p_cellular_receive->job_no
                = cellular_response_string_check(&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt]);
                (* p_cellular_recvtask_api[cellular_receive->job_no])(p_ctrl, cellular_receive);
            }
            else
            {
                /* Do Nothing */
                R_BSP_NOP();
            }
            break;
        }
        default :
        {
            cellular_memclear(p_ctrl, p_cellular_receive);
            break;
        }
    }
    return;
}
/**********************************************************************************************************************
 * End of function cellular_job_check
 *********************************************************************************************************************/

/************************************************************************************************
 * Function Name  @fn            cellular_response_string_check
 * Description    @details       Parse a string.
 * Arguments      @param[in]     p_string -
 *                                  Pointer to parsing string.
 * Return Value   @retval        e_atc_return_code_t -
 *                                  Returns the e-num value corresponding to the analysis result.
 ***********************************************************************************************/
static e_atc_return_code_t cellular_response_string_check(uint8_t * p_string)
{
    uint8_t             cnt = 0;
    e_atc_return_code_t res = CELLULAR_RES_MAX;

    /* WAIT_LOOP */
    while (cnt < CELLULAR_RES_MAX)
    {
        if (NULL != strstr((const char *)p_string,                          //(uint8_t *)->(char *)
                            (const char *)sp_cellular_atc_res_tbl[cnt]))    //(uint8_t *)->(char *)
        {
            break;
        }
        else
        {
            cnt++;
        }
    }
    if (cnt < CELLULAR_RES_MAX)
    {
        res = (e_atc_return_code_t)cnt; //(uint8_t)->(e_atc_return_code_t)
    }

    return res;
}
/**********************************************************************************************************************
 * End of function cellular_response_string_check
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_response_check
 * Description    @details       Parses the received string and returns the result.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_response_check(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if ((char)p_cellular_receive->data == (CHAR_CHECK_4))  //(uint8_t)->(char)
    {
        p_cellular_receive->job_no = cellular_response_string_check(p_ctrl->sci_ctrl.receive_buff);

