renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_cellular/src/private/r_cellular_receive_task.c
        switch (p_cellular_receive->job_no)
        {
            case CELLULAR_RES_OK:
            case CELLULAR_RES_CONNECT:
            {
                cellular_set_atc_response(p_ctrl, ATC_RETURN_OK);
                cellular_memclear(p_ctrl, p_cellular_receive);
                break;
            }
            case CELLULAR_RES_ERROR:
            {
                cellular_set_atc_response(p_ctrl, ATC_RETURN_ERROR);
                cellular_memclear(p_ctrl, p_cellular_receive);
                break;
            }
            case CELLULAR_RES_NO_CARRIER:
            {
                cellular_set_atc_response(p_ctrl, ATC_RETURN_SEND_NO_CARRIER);
                cellular_memclear(p_ctrl, p_cellular_receive);
                break;
            }
            case CELLULAR_RES_EXIT:
            {
                cellular_set_atc_response(p_ctrl, ATC_RETURN_ERROR);
                cellular_exit(p_ctrl, cellular_receive);
                break;
            }
            default:
            {
                if (ATC_GET_SERIAL_NUMBER == p_ctrl->sci_ctrl.at_command)
                {
                    cellular_get_imei(p_ctrl, cellular_receive);
                }
                if (ATC_GET_MODULE_NAME == p_ctrl->sci_ctrl.at_command)
                {
                    cellular_memclear(p_ctrl, p_cellular_receive);
                }
                if (ATC_GET_MAKER_NAME == p_ctrl->sci_ctrl.at_command)
                {
                    cellular_memclear(p_ctrl, p_cellular_receive);
                }
                if (ATC_GET_IMSI == p_ctrl->sci_ctrl.at_command)
                {
                    cellular_get_imsi(p_ctrl, cellular_receive);
                }
                if (ATC_GET_SW_REVISION == p_ctrl->sci_ctrl.at_command)
                {
                    cellular_get_revision(p_ctrl, cellular_receive);
                }
                if (ATC_GET_LR_SVN == p_ctrl->sci_ctrl.at_command)
                {
                    cellular_get_lrsvn(p_ctrl, cellular_receive);
                }
                break;
            }
        }
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_response_check
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_data_send_command
 * Description    @details       Process of sending data to the module.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_data_send_command(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (CHAR_CHECK_6 == p_cellular_receive->data)
    {
        cellular_set_atc_response(p_ctrl, ATC_RETURN_OK_GO_SEND);
        cellular_memclear(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_data_send_command
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_get_data_reception
 * Description    @details       Get data reception notification from module.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_get_data_reception(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    int32_t                 sscanf_ret         = 0;
    int32_t                 socket_no          = 0;
    int32_t                 length             = 0;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        if (NULL != strstr((char *)         //(uint8_t *)->(char *)
                        &p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt],
                            ATC_RES_BEGIN_OR_END))
        {
            sscanf_ret = sscanf((char *)    //(uint8_t *)->(char *)
                            &p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt],
                                " %ld,%ld", &socket_no, &length);
            if (2 == sscanf_ret)
            {
                p_cellular_receive->socket_no  = (uint8_t)socket_no;    // int32_t -> uint8_t
                p_cellular_receive->socket_no -= CELLULAR_START_SOCKET_NUMBER;

                p_ctrl->p_socket_ctrl[p_cellular_receive->socket_no].receive_unprocessed_size += (int16_t)length;//cast
                p_ctrl->p_socket_ctrl[p_cellular_receive->socket_no].receive_count             = 0;

                p_ctrl->p_socket_ctrl[p_cellular_receive->socket_no].receive_flg = CELLULAR_RECEIVE_FLAG_ON;
            }
            cellular_cleardata(p_ctrl, p_cellular_receive);
        }
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_get_data_reception
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_request_data
 * Description    @details       Processing of requests to pass data to the module.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_request_data(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    int32_t                 sscanf_ret         = 0;
    int32_t                 socket_no          = 0;
    int32_t                 length             = 0;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

