renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_cellular/src/private/r_cellular_receive_task.c
    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        sscanf_ret = sscanf((char *)    //(uint8_t *)->(char *)
                        &p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt],
                            " %ld,%ld", &socket_no, &length);
        if (2 == sscanf_ret)
        {
            p_cellular_receive->socket_no  = (uint8_t)socket_no;    // int32_t -> uint8_t
            p_cellular_receive->socket_no -= CELLULAR_START_SOCKET_NUMBER;

            p_ctrl->p_socket_ctrl[p_cellular_receive->socket_no].receive_unprocessed_size -= (int16_t)length; //cast

            if (0 >= p_ctrl->p_socket_ctrl[p_cellular_receive->socket_no].receive_unprocessed_size)
            {
                p_ctrl->p_socket_ctrl[p_cellular_receive->socket_no].receive_unprocessed_size = 0;

                p_ctrl->p_socket_ctrl[p_cellular_receive->socket_no].receive_flg = CELLULAR_RECEIVE_FLAG_OFF;
            }
            p_ctrl->p_socket_ctrl[p_cellular_receive->socket_no].receive_num   = (uint32_t)length; //cast
            p_ctrl->p_socket_ctrl[p_cellular_receive->socket_no].receive_count = 0;
            p_cellular_receive->job_no                                         = CELLULAR_RES_PUT_CHAR;
        }
        else
        {
            cellular_memclear(p_ctrl, p_cellular_receive);
            cellular_set_atc_response(p_ctrl, ATC_RETURN_ERROR);
            CELLULAR_LOG_ERROR(("Incoming data request failed.\n"));
        }
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_request_data
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_store_data
 * Description    @details       Store data received from the module in the byte queue.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_store_data(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (p_ctrl->p_socket_ctrl[p_cellular_receive->socket_no].receive_count <
        p_ctrl->p_socket_ctrl[p_cellular_receive->socket_no].receive_num)
    {
        *(p_ctrl->p_socket_ctrl[p_cellular_receive->socket_no].p_recv +
            p_ctrl->p_socket_ctrl[p_cellular_receive->socket_no].total_recv_count) = p_cellular_receive->data;
        p_ctrl->p_socket_ctrl[p_cellular_receive->socket_no].receive_count++;
        p_ctrl->p_socket_ctrl[p_cellular_receive->socket_no].total_recv_count++;
    }
    else
    {
        if (CHAR_CHECK_4 == p_cellular_receive->data)
        {
            cellular_cleardata(p_ctrl, p_cellular_receive);
            p_ctrl->p_socket_ctrl[p_cellular_receive->socket_no].receive_count = 0;
            p_ctrl->p_socket_ctrl[p_cellular_receive->socket_no].receive_num   = 0;
        }
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_store_data
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_dns_result
 * Description    @details       Process the results of dns query execution.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_dns_result(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    uint32_t                len                = 0;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (CHAR_CHECK_5 == p_cellular_receive->data)
    {
        p_cellular_receive->tmp_recvcnt = p_cellular_receive->recv_count;
    }
    else if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        if (NULL != p_ctrl->recv_data)
        {
            len = (uint32_t)strlen((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt]);    //cast
            if (CELLULAR_DNS_LENGTH >= len)
            {
                sprintf(p_ctrl->recv_data, "%s", &p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt]);
            }
            else
            {
                CELLULAR_LOG_ERROR(("DNS Result Buffer Size Error\n"));
            }
        }
        cellular_cleardata(p_ctrl, p_cellular_receive);
    }
    else
    {
        /* Do Nothing */
        R_BSP_NOP();
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_dns_result
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_get_ap_connect_status
 * Description    @details       Process connection status notification to the access point.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_get_ap_connect_status(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    int32_t                 sscanf_ret         = 0;
    int32_t                 status             = 0;
    e_atc_list_t            active_atc;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

