renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_cellular/src/private/r_cellular_receive_task.c
    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        active_atc = cellular_get_at_command(p_ctrl);

        if (ATC_CONNECT_CHECK == active_atc)
        {
            sscanf_ret = sscanf((char *) //(uint8_t *)->(char *)
                            &p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt],
                                " %ld" , &status);
            if ((1 == sscanf_ret) && (1 == status) && (CELLULAR_SYSTEM_CLOSE != p_ctrl->system_state))
            {
                p_ctrl->system_state = CELLULAR_SYSTEM_CONNECT;
            }
        }
        cellular_cleardata(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_get_ap_connect_status
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_get_ap_connect_config
 * Description    @details       Processes connection setup notifications to access points.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_get_ap_connect_config(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    uint8_t                 pdp_type[7]        = {0};
    uint8_t                 apn[6]             = {0};
    uint8_t *               p_flg[1][2]        = {0};
    int32_t                 cid                = 0;
    int32_t                 sscanf_ret         = 0;
    sci_err_t               sci_ret;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        sscanf_ret = sscanf((char *) //(uint8_t *)->(char *)
                        &p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt],
                            " %ld,\"%6[0-9A-Z]\",\"%5[a-zA-Z.]\"" , &cid, pdp_type, apn);
        if ((0 < sscanf_ret) && (NULL != p_ctrl->recv_data))
        {
            p_flg[0][0]  = (uint8_t *)p_ctrl->recv_data + (7 *(cid - 1));       //(void *)->(uint8_t *)
            *p_flg[0][0] = 1;
            p_flg[0][1]  = (uint8_t *)p_ctrl->recv_data + 1 + (7 *(cid - 1));   //(void *)->(uint8_t *)
            sprintf((char *)p_flg[0][1], "%5s", apn);                           //(uint8_t *)->(char *)
        }

        cellular_cleardata(p_ctrl, p_cellular_receive);

        /* WAIT_LOOP */
        do
        {
            sci_ret = R_SCI_Receive(p_ctrl->sci_ctrl.sci_hdl, &p_cellular_receive->data, 1);
            cellular_delay_task(1);
        } while (SCI_SUCCESS != sci_ret);

        p_ctrl->sci_ctrl.receive_buff[0] = p_cellular_receive->data;
        p_cellular_receive->recv_count++;
        if (CHAR_CHECK_1 == p_cellular_receive->data)
        {
            p_cellular_receive->job_no      = CELLULAR_GET_AP_CONNECT_CONFIG;
            p_cellular_receive->tmp_recvcnt = 9;
        }
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_get_ap_connect_config
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_station_info
 * Description    @details       Notification of connected base station information.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_station_info(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    int32_t                 tec                = 0;
    int32_t                 stat               = 0;
    int32_t                 level              = 0;
    e_atc_list_t            ret                = ATC_LIST_MAX;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;
    st_cellular_notice_t *  p_cellular_notice  = p_ctrl->recv_data;

    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        ret = cellular_get_at_command(p_ctrl);

        if ((ATC_GET_NOTICE_LEVEL == ret) && (NULL != p_cellular_notice))
        {
            sscanf((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt], //(&uint8_t[]->char*)
                    " %ld,%ld,\"%4s\",\"%8s\",%ld,,,\"%8s\",\"%8s\"",
                    &level,
                    &stat,
                    (char *)p_cellular_notice->ta_code,     //(&uint8_t[]->char*)
                    (char *)p_cellular_notice->cell_id,     //(&uint8_t[]->char*)
                    &tec,
                    (char *)p_cellular_notice->active_time, //(&uint8_t[]->char*)
                    (char *)p_cellular_notice->tau);        //(&uint8_t[]->char*)

            p_cellular_notice->level      = (e_cellular_network_result_t)level;//(int32_t->e_cellular_network_result_t)
            p_cellular_notice->stat       = (e_cellular_reg_stat_t)stat;       //(int32_t->e_cellular_reg_stat_t)
            p_cellular_notice->access_tec = (e_cellular_access_tec_t)tec;      //(int32_t->e_cellular_access_tec_t)
        }
        else
        {
            sscanf((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt], //(&uint8_t[]->char*)
                                " %ld", &stat);
        }
        cellular_system_state_change(p_ctrl, stat);
        cellular_cleardata(p_ctrl, p_cellular_receive);
        memset(p_ctrl->sci_ctrl.receive_buff, 0, sizeof(p_ctrl->sci_ctrl.receive_buff));
        memset(p_cellular_receive, 0, sizeof(st_cellular_receive_t));
        p_cellular_receive->job_no = CELLULAR_RES_NONE;
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_station_info
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_control_level
 * Description    @details       Process module control level notifications.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_control_level(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    int32_t                 sscanf_ret         = 0;
    int32_t                 status             = 0;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

