renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_cellular/src/private/r_cellular_receive_task.c
    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        sscanf_ret = sscanf((char *) //(uint8_t *)->(char *)
                        &p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt],
                            " %ld", &status);

        if ((1 == sscanf_ret))
        {
            p_ctrl->module_status = (e_cellular_module_status_t)status; //cast
        }
        else
        {
            /* Do Nothing */
            CELLULAR_LOG_DEBUG(("Received unexpected string"));
        }
        cellular_cleardata(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_control_level
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_cpin_status
 * Description    @details       Handle notification of sim card lock status.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_cpin_status(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    uint32_t                len                = 0;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        if (NULL != p_ctrl->recv_data)
        {
            len = (uint32_t)strlen((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt]);    //cast
            if (CELLULAR_CPIN_STATUS_LENGTH >= len)
            {
                sprintf(p_ctrl->recv_data, "%s", &p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt]);
            }
            else
            {
                CELLULAR_LOG_ERROR(("CPIN Status Buffer Size Error\n"));
            }
        }
        cellular_cleardata(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_cpin_status
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_get_time
 * Description    @details       Process the results of getting the date and time.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_get_time(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    int32_t                  year               = 0;
    int32_t                  month              = 0;
    int32_t                  day                = 0;
    int32_t                  hour               = 0;
    int32_t                  min                = 0;
    int32_t                  sec                = 0;
    int32_t                  timezone           = 0;
    st_cellular_receive_t *  p_cellular_receive = cellular_receive;
    st_cellular_datetime_t * p_date_time        = p_ctrl->recv_data;

    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        if (NULL != p_date_time)
        {
            sscanf((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt], //(&uint8_t[]->char*)
                    " \"%2d/%2d/%2d,%2d:%2d:%2d%3d\"\r\n",
                    &year, &month, &day, &hour, &min, &sec, &timezone);
            p_date_time->year     = (uint8_t)year;      // int32_t -> uint8_t
            p_date_time->month    = (uint8_t)month;     // int32_t -> uint8_t
            p_date_time->day      = (uint8_t)day;       // int32_t -> uint8_t
            p_date_time->hour     = (uint8_t)hour;      // int32_t -> uint8_t
            p_date_time->min      = (uint8_t)min;       // int32_t -> uint8_t
            p_date_time->sec      = (uint8_t)sec;       // int32_t -> uint8_t
            p_date_time->timezone = (int8_t)timezone;   // int32_t -> int8_t
        }
        cellular_cleardata(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_get_time
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_get_imei
 * Description    @details       Process the results of getting the IMEI.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_get_imei(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    uint32_t                len                = 0;
    st_cellular_imei_t *    p_imei             = p_ctrl->recv_data;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        len = (uint32_t)strlen((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt]);//cast
        if ((CELLULAR_MAX_IMEI_LENGTH >= (len - CELLULAR_IMEI_USELESS_CHAR)) && (NULL != p_imei))
        {
            sscanf((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt], //(&uint8_t[] -> char *)
                    "%15[0-9]", (char *)p_imei->imei);                                      //(&uint8_t[] -> char *)
        }
        else
        {
            CELLULAR_LOG_ERROR(("IMEI Buffer Size Error\n"));
        }
        cellular_cleardata(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_get_imei
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_get_imsi
 * Description    @details       Process the results of getting the IMSI.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_get_imsi(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    uint32_t                len                = 0;
    st_cellular_imsi_t *    p_imsi             = p_ctrl->recv_data;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

