renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_cellular/src/private/r_cellular_receive_task.c
    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        len = (uint32_t)strlen((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt]);    //cast
        if ((CELLULAR_MAX_IMSI_LENGTH >= (len - CELLULAR_IMSI_USELESS_CHAR)) && (NULL != p_imsi))
        {
            sscanf((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt],     //(&uint8_t[] -> char *)
                    "%15[0-9]", (char *)p_imsi->imsi);                                          //(&uint8_t[] -> char *)
        }
        else
        {
            CELLULAR_LOG_ERROR(("IMSI Buffer Size Error\n"));
        }
        cellular_cleardata(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_get_imsi
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_system_start
 * Description    @details       Module start-up notification.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_system_start(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (NULL != p_ctrl->recv_data)
    {
        *(uint8_t *)p_ctrl->recv_data = CELLULAR_FLG_START;    //(void *)->(uint8_t *)
    }

    cellular_cleardata(p_ctrl, p_cellular_receive);

    return;
}
/**********************************************************************************************************************
 * End of function cellular_system_start
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_disconnect_socket
 * Description    @details       Handling of Socket Disconnection Notification.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_disconnect_socket(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    int32_t                 sscanf_ret         = 0;
    int32_t                 socket_no          = 0;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        sscanf_ret = sscanf((char *) //(uint8_t *)->(char *)
                        &p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt],
                            " %ld" , &socket_no);
        if (0 != sscanf_ret)
        {
            p_ctrl->p_socket_ctrl[socket_no - CELLULAR_START_SOCKET_NUMBER].socket_status
            = CELLULAR_SOCKET_STATUS_SOCKET;
        }

        cellular_cleardata(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_disconnect_socket
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_get_timezone
 * Description    @details       Processing of notification of timezone information from modules.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_get_timezone(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        cellular_cleardata(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_get_timezone
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_get_service_status
 * Description    @details       Get access technology and network operators.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_get_service_status(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    int32_t                 status_1           = 0;
    int32_t                 status_2           = 0;
    int32_t                 status_3           = 0;
    int32_t                 status_4           = 0;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

