renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_cellular/src/private/r_cellular_receive_task.c
    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        sscanf((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt], //(uint8_t *)->(char *)
                " %ld,%ld,\"%ld\",%ld",
                &status_1, &status_2, &status_3, &status_4);
        cellular_cleardata(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_get_service_status
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_get_pdp_status
 * Description    @details       Get the state of the PDP context.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_get_pdp_status(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    int32_t                 status_1           = 0;
    int32_t                 status_2           = 0;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        sscanf((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt], //(uint8_t *)->(char *)
                " %ld,%ld", &status_1, &status_2);
        cellular_cleardata(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_get_pdp_status
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_get_pdp_addr
 * Description    @details       Process for obtaining PDP addresses.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_get_pdp_addr(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    uint32_t                len                = 0;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        if (NULL != p_ctrl->recv_data)
        {
            len = (uint32_t)strlen((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt]);    //cast
            if (CELLULAR_PDP_ADDR_LENGTH >= len)
            {
                sprintf(p_ctrl->recv_data, "%s", &p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt]);
            }
            else
            {
                CELLULAR_LOG_ERROR(("Get PDP Addr Buffer Size Error\n"));
            }

        }
        cellular_cleardata(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_get_pdp_addr
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_get_psms
 * Description    @details       Get PSM configuration status.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_get_psms(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    int32_t                    status             = 0;
    int32_t                    tau_cycle          = 0;
    int32_t                    tau_multiplier     = 0;
    int32_t                    active_cycle       = 0;
    int32_t                    active_multiplier  = 0;
    st_cellular_receive_t *    p_cellular_receive = cellular_receive;
    st_cellular_psm_config_t * p_psm_ret          = p_ctrl->recv_data;

    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        if (NULL != p_psm_ret)
        {
            sscanf((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt], //(uint8_t *)->(char *)
                    " %ld,,,\"%3d%5d\",\"%3d%5d\"",
                    &status, &tau_cycle, &tau_multiplier, &active_cycle, &active_multiplier);
            p_psm_ret->psm_mode          = (e_cellular_psm_mode_t)status;                                       //cast
            p_psm_ret->tau_cycle         = (e_cellular_tau_cycle_t)binary_conversion(tau_cycle);                //cast
            p_psm_ret->tau_multiplier    = (e_cellular_cycle_multiplier_t)binary_conversion(tau_multiplier);    //cast
            p_psm_ret->active_cycle      = (e_cellular_active_cycle_t)binary_conversion(active_cycle);          //cast
            p_psm_ret->active_multiplier = (e_cellular_cycle_multiplier_t)binary_conversion(active_multiplier); //cast
        }
        cellular_cleardata(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_get_psms
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_get_edrx
 * Description    @details       Get edrx configuration status.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_get_edrx(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    int32_t                     status             = 0;
    int32_t                     act_type           = 0;
    int32_t                     requested_edrx     = 0;
    int32_t                     provided_edrx      = 0;
    int32_t                     ptw                = 0;
    st_cellular_receive_t *     p_cellular_receive = cellular_receive;
    st_cellular_edrx_config_t * p_edrx_ret         = p_ctrl->recv_data;

