renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_cellular/src/private/r_cellular_receive_task.c
    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        if ((ATC_GET_EDRXS == p_ctrl->sci_ctrl.at_command) && (NULL != p_edrx_ret))
        {
            sscanf((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt], //(uint8_t *)->(char *)
                    " %ld,%ld,\"%ld\",\"%ld\"",
                    &status, &act_type, &provided_edrx, &ptw);
            p_edrx_ret->edrx_mode  = (e_cellular_edrx_mode_t)status;                            //cast
            p_edrx_ret->edrx_cycle = (e_cellular_edrx_cycle_t)binary_conversion(provided_edrx); //cast
            p_edrx_ret->ptw_cycle  = (e_cellular_ptw_cycle_t)binary_conversion(ptw);            //cast
        }
        else
        {
            sscanf((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt], //(uint8_t *)->(char *)
                    " %ld,\"%ld\",\"%ld\",\"%ld\"",
                    &status, &requested_edrx, &provided_edrx, &ptw);
        }
        cellular_cleardata(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_get_edrx
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_get_signal
 * Description    @details       Get signal strength levels.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_get_signal(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    st_cellular_rssi_t *    p_rssi             = p_ctrl->recv_data;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        if (NULL != p_rssi)
        {
            sscanf((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt], //(uint8_t *) -> (char *)
                    " %2s,%2s", (char *)p_rssi->rssi, (char *)p_rssi->ber);                 //(&uint8_t[]) -> (char *)
        }
        cellular_cleardata(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_get_signal
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_res_command_send_sim
 * Description    @details       Get the number of the AT command being executed.
 * Arguments      @param[in]     p_ctrl -
 *                                  Pointer to managed structure.
 * Return Value   @retval        e_atc_list_t -
 *                                  AT command number being executed.
 **********************************************************************************************/
static void cellular_res_command_send_sim(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    uint8_t                 response[100+1]    = {0};
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        sscanf((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt], //(uint8_t *)->(char *)
                " %100s", &response);

        cellular_cleardata(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_res_command_send_sim
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_timezone_info
 * Description    @details       Processing of notification of timezone information from modules.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_timezone_info(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        cellular_cleardata(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_timezone_info
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_ind_info
 * Description    @details       Processing of notification of indicator information from modules.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_ind_info(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

