renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_cellular/src/private/r_cellular_receive_task.c
    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        p_cellular_receive = cellular_receive;
        cellular_cleardata(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_ind_info
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_get_svn
 * Description    @details       Get Software Version Number.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_get_svn(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    uint32_t                len                = 0;
    st_cellular_svn_t *     p_svn              = p_ctrl->recv_data;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        len = (uint32_t)strlen((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt]);  //cast
        if ((CELLULAR_MAX_SVN_LENGTH >= (len - CELLULAR_SVN_USELESS_CHAR)) && (NULL != p_svn))
        {
            sscanf((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt], //(&uint8_t[] -> char *)
                    " \"%2[a-zA-Z0-9]", (char *)p_svn->svn);                                //(&uint8_t[] -> char *)
        }
        else
        {
            CELLULAR_LOG_ERROR(("SVN Buffer Size Error\n"));
        }
        cellular_cleardata(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_get_svn
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_get_revision
 * Description    @details       Get Revision.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_get_revision(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    uint32_t                len                = 0;
    st_cellular_svn_t *     p_svn              = p_ctrl->recv_data;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        len = (uint32_t)strlen((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt]);  //cast
        if ((CELLULAR_MAX_REVISION_LENGTH >= (len - CELLULAR_REVISION_USELESS_CHAR)) && (NULL != p_svn))
        {
            sscanf((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt], //(&uint8_t[] -> char *)
                    "%9[a-zA-Z0-9.]", (char *)p_svn->revision);                             //(&uint8_t[] -> char *)
        }
        else
        {
            CELLULAR_LOG_ERROR(("Revision Buffer Size Error\n"));
        }
        cellular_cleardata(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_get_revision
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_get_lrsvn
 * Description    @details       Get UE and LR software versions.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_get_lrsvn(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    uint32_t                len                = 0;
    uint8_t                 ue[]               = "UE";
    uint8_t                 lr[]               = "LR";
    st_cellular_svn_t *     p_svn              = p_ctrl->recv_data;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        if (NULL != strstr((char *)p_ctrl->sci_ctrl.receive_buff, (char *)ue))  //(uint8_t *)->(char *)
        {
            len = (uint32_t)strlen((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt]);  //cast
            if ((CELLULAR_MAX_REVISION_LENGTH >= (len - CELLULAR_REVISION_USELESS_CHAR)) && (NULL != p_svn))
            {
                sscanf((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt], //(uint8_t *)->(char *)
                        "%9[a-zA-Z0-9.]", (char *)p_svn->revision);                             //(uint8_t *)->(char *)
            }
            else
            {
                CELLULAR_LOG_ERROR(("Revision Buffer Size Error\n"));
            }
            cellular_cleardata(p_ctrl, p_cellular_receive);
            p_cellular_receive->job_no = CELLULAR_RES_CHECK;
        }
        if (NULL != strstr((char *)p_ctrl->sci_ctrl.receive_buff, (char *)lr))  //(uint8_t *)->(char *)
        {
            len = (uint32_t)strlen((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt]);  //cast
            if ((CELLULAR_MAX_LR_SVN_LENGTH >= (len - CELLULAR_LR_SVN_USELESS_CHAR)) && (NULL != p_svn))
            {
                sscanf((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt], //(uint8_t *)->(char *)
                        "%15[a-zA-Z0-9-.]", (char *)p_svn->lr_svn);                             //(uint8_t *)->(char *)
            }
            else
            {
                CELLULAR_LOG_ERROR(("Revision Buffer Size Error\n"));
            }
            cellular_cleardata(p_ctrl, p_cellular_receive);
        }
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_get_lrsvn
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_get_phone_number
 * Description    @details       Get phone number.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_get_phone_number(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    uint32_t                 len                = 0;
    st_cellular_receive_t *  p_cellular_receive = cellular_receive;
    st_cellular_phonenum_t   phonenum           = {0};
    st_cellular_phonenum_t * p_phonenum         = p_ctrl->recv_data;

