renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_cellular/src/private/r_cellular_receive_task.c
    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        len = (uint32_t)strlen((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt]);  //cast
        if ((CELLULAR_MAX_PHONENUM_LENGTH >= (len - CELLULAR_PHONENUM_USELESS_CHAR)) && (NULL != p_phonenum))
        {
            sscanf((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt],     //cast
                    " %15[^,],\"%15[0-9]", (char *)&phonenum, (char *)p_phonenum->phonenum);    //cast
        }
        else
        {
            CELLULAR_LOG_ERROR(("Revision Buffer Size Error\n"));
        }
        cellular_cleardata(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_get_phone_number
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_get_iccid
 * Description    @details       Get ICCID.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_get_iccid(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    uint32_t                len                = 0;
    st_cellular_iccid_t *   p_iccid            = p_ctrl->recv_data;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        len = (uint32_t)strlen((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt]);  //cast
        if ((CELLULAR_MAX_ICCID_LENGTH >= (len - CELLULAR_ICCID_USELESS_CHAR)) && (NULL != p_iccid))
        {
            sscanf((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt], //(uint8_t * -> char *)
                    " \"%22[0-9]", (char *)p_iccid->iccid);                                 //(&uint8_t[] -> char *)
        }
        else
        {
            CELLULAR_LOG_ERROR(("ICCID Buffer Size Error\n"));
        }
        cellular_cleardata(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_get_iccid
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_ping
 * Description    @details       PING results.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_ping(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    sci_err_t               sci_ret;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        cellular_cleardata(p_ctrl, p_cellular_receive);

        /* WAIT_LOOP */
        do
        {
            sci_ret = R_SCI_Receive(p_ctrl->sci_ctrl.sci_hdl, &p_cellular_receive->data, 1);
            cellular_delay_task(1);
        } while (SCI_SUCCESS != sci_ret);

        p_ctrl->sci_ctrl.receive_buff[0] = p_cellular_receive->data;
        p_cellular_receive->recv_count++;
        if (CHAR_CHECK_1 == p_cellular_receive->data)
        {
            p_cellular_receive->job_no      = CELLULAR_PING;
            p_cellular_receive->tmp_recvcnt = 6;
        }
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_ping
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_get_cellinfo
 * Description    @details       Notification of cell information.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_get_cellinfo(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    sci_err_t               sci_ret;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        cellular_cleardata(p_ctrl, p_cellular_receive);

        /* WAIT_LOOP */
        do
        {
            sci_ret = R_SCI_Receive(p_ctrl->sci_ctrl.sci_hdl, &p_cellular_receive->data, 1);
            cellular_delay_task(1);
        } while (SCI_SUCCESS != sci_ret);

        p_ctrl->sci_ctrl.receive_buff[0] = p_cellular_receive->data;
        p_cellular_receive->recv_count++;
        if (CHAR_CHECK_1 == p_cellular_receive->data)
        {
            p_cellular_receive->job_no      = CELLULAR_GET_CELLINFO;
            p_cellular_receive->tmp_recvcnt = 9;
        }
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_get_cellinfo
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_get_autoconnect
 * Description    @details       Get ICCID.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_get_autoconnect(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    int32_t                 type               = 0;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

