renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_cellular/src/private/r_cellular_receive_task.c
    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        if (NULL != p_ctrl->recv_data)
        {
            sscanf((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt],     //(uint8_t * -> char *)
                    " %ld", &type);
            *(e_cellular_auto_connect_t *)p_ctrl->recv_data = (e_cellular_auto_connect_t)type;  //cast
        }
        cellular_cleardata(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_get_autoconnect
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_get_ctm
 * Description    @details       Get Conformance Test Mode.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_get_ctm(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    uint32_t                len                = 0;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        len = (uint32_t)strlen((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt]);  //cast
        if ((CELLULAR_MAX_CTM_LENGTH >= (len - CELLULAR_CTM_USELESS_CHAR)) && (NULL != p_ctrl->recv_data))
        {
            sscanf((char *)&p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->tmp_recvcnt], //(uint8_t *) -> (char *)
                    " %20[a-zA-Z0-9-]", (char *)p_ctrl->recv_data);                         //(void *) -> (char *)
        }
        else
        {
            CELLULAR_LOG_ERROR(("CTM Buffer Size Error\n"));
        }
        cellular_cleardata(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_get_ctm
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_set_smcwrx
 * Description    @details       Starts a downlink continuous wave service.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_set_smcwrx(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        cellular_cleardata(p_ctrl, p_cellular_receive);
        p_cellular_receive->job_no = CELLULAR_RES_CHECK;
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_set_smcwrx
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_set_smcwtx
 * Description    @details       Starts an uplink continuous wave service.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_set_smcwtx(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        cellular_cleardata(p_ctrl, p_cellular_receive);
        p_cellular_receive->job_no = CELLULAR_RES_CHECK;
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_set_smcwtx
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_shutdown_info
 * Description    @details       Shutdown notification from module.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_shutdown_info(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (NULL != p_ctrl->recv_data)
    {
        *(uint8_t *)p_ctrl->recv_data = CELLULAR_FLG_SHUTDOWN;   //(void *)->(uint8_t *)
    }

    cellular_cleardata(p_ctrl, p_cellular_receive);

    return;
}
/**********************************************************************************************************************
 * End of function cellular_shutdown_info
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_firmupgrade_info
 * Description    @details       Firm Upgrade Status Notification.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_firmupgrade_info(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    uint32_t                len                = 0;
    sci_err_t               sci_ret;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

