renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_cellular/src/private/r_cellular_receive_task.c
    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        if (NULL != p_ctrl->recv_data)
        {
            if (NULL != strstr((char *)p_ctrl->recv_data, CELLULAR_GET_UPDATE_STATE))   //cast
            {
                len = (uint32_t)strlen((char *)&p_ctrl->sci_ctrl.receive_buff[2]);      //cast
                if (CELLULAR_UPDATE_STATE_LENGTH >= len)
                {
                    sprintf(p_ctrl->recv_data, "%s", &p_ctrl->sci_ctrl.receive_buff[2]);
                }
                else
                {
                    CELLULAR_LOG_ERROR(("Firm Upgrade info Buffer Size Error\n"));
                }
            }
        }
        cellular_cleardata(p_ctrl, p_cellular_receive);

        /* WAIT_LOOP */
        while (1)
        {
            /* WAIT_LOOP */
            do
            {
                sci_ret = R_SCI_Receive(p_ctrl->sci_ctrl.sci_hdl, &p_cellular_receive->data, 1);
                cellular_delay_task(1);
            } while (SCI_SUCCESS != sci_ret);

            p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->recv_count] = p_cellular_receive->data;
            p_cellular_receive->recv_count++;

            if (CHAR_CHECK_4 == p_cellular_receive->data)
            {
                /* WAIT_LOOP */
                do
                {
                    sci_ret = R_SCI_Receive(p_ctrl->sci_ctrl.sci_hdl, &p_cellular_receive->data, 1);
                    cellular_delay_task(1);
                } while (SCI_SUCCESS != sci_ret);

                cellular_charcheck(p_ctrl, p_cellular_receive);

                break;
            }
        }
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_firmupgrade_info
 *********************************************************************************************************************/


/***********************************************************************************************
 * Function Name  @fn            cellular_get_certificate
 * Description    @details       Retrieve the written certificate.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_get_certificate(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    uint8_t *               p_recv             = p_ctrl->recv_data;
    uint32_t                len                = 0;
    sci_err_t               sci_ret;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        len = (uint32_t)strlen((char *)&p_ctrl->sci_ctrl.receive_buff[2]);    //cast
        if ((CELLULAR_ATC_RESPONSE_BUFF_SIZE >= len) && (NULL != p_ctrl->recv_data))
        {
            sprintf(p_ctrl->recv_data, "%s", &p_ctrl->sci_ctrl.receive_buff[2]);
        }
        else
        {
            CELLULAR_LOG_ERROR(("Get certificate Buffer Size Error\n"));
        }
        cellular_cleardata(p_ctrl, p_cellular_receive);

        /* WAIT_LOOP */
        while (1)
        {
            /* WAIT_LOOP */
            do
            {
                sci_ret = R_SCI_Receive(p_ctrl->sci_ctrl.sci_hdl, &p_cellular_receive->data, 1);
                cellular_delay_task(1);
            } while (SCI_SUCCESS != sci_ret);

            if ('\r' != p_cellular_receive->data)
            {
                if (CELLULAR_ATC_RESPONSE_BUFF_SIZE > len)
                {
                    p_recv[len] = p_cellular_receive->data;
                    len++;
                }

                /* WAIT_LOOP */
                do
                {
                    sci_ret = R_SCI_Receive(p_ctrl->sci_ctrl.sci_hdl, &p_cellular_receive->data, 1);
                    cellular_delay_task(1);
                    if (SCI_SUCCESS == sci_ret)
                    {
                        if (CELLULAR_ATC_RESPONSE_BUFF_SIZE > len)
                        {
                            p_recv[len] = p_cellular_receive->data;
                            len++;
                        }
                    }
                } while ((SCI_SUCCESS != sci_ret) || (CHAR_CHECK_4 != p_cellular_receive->data));
            }
            else
            {
                if (CELLULAR_ATC_RESPONSE_BUFF_SIZE > p_cellular_receive->recv_count)
                {
                    p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->recv_count] = p_cellular_receive->data;
                    p_cellular_receive->recv_count++;
                }
                else
                {
                    CELLULAR_LOG_ERROR(("Get Certificate Buffer Size Error\n"));
                }
                break;
            }
        }
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_get_certificate
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_response_skip
 * Description    @details       Processing of notification of time information from modules.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_response_skip(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

