renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_cellular/src/private/r_cellular_receive_task.c
    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        CELLULAR_LOG_DEBUG(("SKIP URC\n"));
        cellular_cleardata(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_response_skip
 *********************************************************************************************************************/

/***************************************************************************************************
 * Function Name  @fn            cellular_exit
 * Description    @details       Detecting Exit.
 *                               After this error detection, the module is automatically restarted.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **************************************************************************************************/
static void cellular_exit(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    if (CHAR_CHECK_4 == p_cellular_receive->data)
    {
        cellular_cleardata(p_ctrl, p_cellular_receive);
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_exit
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_memclear
 * Description    @details       Clear memory.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_memclear(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

    CELLULAR_LOG_DEBUG(("clear buff = %s\n", p_ctrl->sci_ctrl.receive_buff));

    memset(p_ctrl->sci_ctrl.receive_buff, 0, sizeof(p_ctrl->sci_ctrl.receive_buff));
    memset(p_cellular_receive, 0, sizeof(st_cellular_receive_t));
    p_cellular_receive->job_no = CELLULAR_RES_NONE;

    return;
}
/**********************************************************************************************************************
 * End of function cellular_memclear
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_system_state_change
 * Description    @details       Update system_state.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     stat -
 *                                  Updated system_state.
 **********************************************************************************************/
static void cellular_system_state_change(st_cellular_ctrl_t * p_ctrl, int32_t stat)
{
    if (CELLULAR_SYSTEM_CLOSE != p_ctrl->system_state)
    {
        if ((1 == stat) || (5 == stat))
        {
            p_ctrl->system_state = CELLULAR_SYSTEM_CONNECT;
        }
        else if ((0 == stat) || (4 == stat) || (80 == stat))
        {
            p_ctrl->system_state = CELLULAR_SYSTEM_OPEN;
        }
        else
        {
            p_ctrl->system_state = CELLULAR_SYSTEM_OPEN;
        }
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_system_state_change
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_get_at_command
 * Description    @details       Get the number of the AT command being executed.
 * Arguments      @param[in]     p_ctrl -
 *                                  Pointer to managed structure.
 * Return Value   @retval        e_atc_list_t -
 *                                  AT command number being executed.
 **********************************************************************************************/
static e_atc_list_t cellular_get_at_command(st_cellular_ctrl_t * const p_ctrl)
{
    return p_ctrl->sci_ctrl.at_command;
}
/**********************************************************************************************************************
 * End of function cellular_get_at_command
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_set_atc_response
 * Description    @details       Stores responses to AT commands.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     result -
 *                                  Response from module.
 **********************************************************************************************/
static void cellular_set_atc_response(st_cellular_ctrl_t * const p_ctrl, const e_cellular_atc_return_t result)
{
    if (CELLULAR_ATC_RESPONSE_UNCONFIRMED == p_ctrl->sci_ctrl.atc_flg)
    {
        p_ctrl->sci_ctrl.atc_res = result;
        p_ctrl->sci_ctrl.atc_flg = CELLULAR_ATC_RESPONSE_CONFIRMED;
        CELLULAR_LOG_DEBUG(("received AT command response: %s", p_ctrl->sci_ctrl.receive_buff));
    }
    return;
}
/**********************************************************************************************************************
 * End of function cellular_set_atc_response
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_cleardata
 * Description    @details       Clear memory.
 * Arguments      @param[in]     p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_cleardata(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    int16_t                 cnt;
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

#if CELLULAR_CFG_URC_CHARGET_ENABLED == 1
    CELLULAR_CFG_URC_CHARGET_FUNCTION(p_ctrl->sci_ctrl.receive_buff);
#endif

    /* WAIT_LOOP */
    for (cnt = 0; cnt < CELLULAR_ATC_RESPONSE_BUFF_SIZE; cnt++)
    {
        if ((p_ctrl->sci_ctrl.receive_buff[cnt] < 0x20) || (p_ctrl->sci_ctrl.receive_buff[cnt] > 0x7e))
        {
            if ('\0' == p_ctrl->sci_ctrl.receive_buff[cnt])
            {
                cnt = CELLULAR_ATC_RESPONSE_BUFF_SIZE;
            }
            else if (('\n' != p_ctrl->sci_ctrl.receive_buff[cnt]) && ('\r' != p_ctrl->sci_ctrl.receive_buff[cnt]))
            {
                p_ctrl->sci_ctrl.receive_buff[cnt] = 0;
            }
            else
            {
                /* Do Nothing */
                R_BSP_NOP();
            }
        }
    }
    p_ctrl->sci_ctrl.receive_buff[CELLULAR_ATC_RESPONSE_BUFF_SIZE-1] = (uint8_t)CHAR_END;   //cast
    CELLULAR_LOG_DEBUG(("URC = %s\n", p_ctrl->sci_ctrl.receive_buff));

    memset(p_ctrl->sci_ctrl.receive_buff, 0, sizeof(p_ctrl->sci_ctrl.receive_buff));
    memset(p_cellular_receive, 0, sizeof(st_cellular_receive_t));
    p_cellular_receive->job_no = CELLULAR_RES_NONE;

    return;
}
/**********************************************************************************************************************
 * End of function cellular_cleardata
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            cellular_charcheck
 * Description    @details       Character check.
 * Arguments      @param[in]     p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] cellular_receive -
 *                                  Pointer to structure for analysis processing.
 **********************************************************************************************/
static void cellular_charcheck(st_cellular_ctrl_t * p_ctrl, st_cellular_receive_t * cellular_receive)
{
    st_cellular_receive_t * p_cellular_receive = cellular_receive;

