renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_gcc/src/smc_gen/r_cellular/src/private/r_cellular_receive_task.c
    if (CHAR_CHECK_1 == p_cellular_receive->data)
    {
        p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->recv_count] = p_cellular_receive->data;
        p_cellular_receive->recv_count++;
        p_cellular_receive->job_status = JOB_STATUS_COLON_CHECK;
    }
    else if (CHAR_CHECK_2 == p_cellular_receive->data)
    {
        p_cellular_receive->job_no = CELLULAR_RES_GO_SEND;
    }
    else if (CHAR_CHECK_7 == p_cellular_receive->data)
    {
        p_cellular_receive->recv_count = 1;
    }
    else
    {
        p_ctrl->sci_ctrl.receive_buff[p_cellular_receive->recv_count] = p_cellular_receive->data;
        p_cellular_receive->recv_count++;
        p_cellular_receive->job_no = CELLULAR_RES_CHECK;
    }

    return;
}
/**********************************************************************************************************************
 * End of function cellular_charcheck
 *********************************************************************************************************************/

/***********************************************************************************************
 * Function Name  @fn            binary_conversion
 * Description    @details       Convert binary numbers to decimal numbers.
 **********************************************************************************************/
static int32_t binary_conversion(int32_t binary)
{
    int32_t decimal = 0;
    int32_t base    = 1;

    /* WAIT_LOOP */
    while (binary > 0)
    {
        decimal = decimal + ((binary % 10) * base);
        binary  = binary / 10;
        base    = base * 2;
    }

    return decimal;
}
/**********************************************************************************************************************
 * End of function binary_conversion
 *********************************************************************************************************************/
